---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AssetPropertyDoubleArray3d Methods
AssetPropertyDoubleArray3d Class See Also Send Feedback
---

The AssetPropertyDoubleArray3d type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | AddConnectedAsset | Adds a new connected asset attached to this asset property, if it allows it.  (Inherited from AssetProperty.) |
|  | AddCopyAsConnectedAsset | Makes a copy of the asset and connects it to this property.  (Inherited from AssetProperty.) |
|  | Dispose | (Inherited from AssetProperty.) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | GetAllConnectedProperties | Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.  (Inherited from AssetProperty.) |
|  | GetConnectedProperty | Gets one connected property with specified index.  (Inherited from AssetProperty.) |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetSingleConnectedAsset | Gets the single connected asset attached to this asset property, if it exists.  (Inherited from AssetProperty.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | GetValueAsDoubles | Get the value property as doubles. |
|  | GetValueAsXYZ | Get the value property as a vector or point XYZ. |
|  | IsEditable | Check if property can be edited.  (Inherited from AssetProperty.) |
|  | IsValidSchemaIdentifier | Check that schema name is valid  (Inherited from AssetProperty.) |
|  | IsValidValue | Checks that the value is a valid value for this property. |
|  | RemoveConnectedAsset | Removes the connected asset attached to this asset property if any.  (Inherited from AssetProperty.) |
|  | SetValueAsXYZ | Sets the value property as a vector or point XYZ. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

AssetPropertyDoubleArray3d Class

Autodesk.Revit.DB.Visual Namespace